; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 671355 2 2 2 3 2
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	image0 - mode
	image1 - mode
	GroundStation0 - direction
	Star2 - direction
	Star1 - direction
	Phenomenon3 - direction
	Star4 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 image1)
	(calibration_target instrument0 Star1)
	(supports instrument1 image1)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument2 image1)
	(calibration_target instrument2 Star1)
	(supports instrument3 image1)
	(supports instrument3 image0)
	(calibration_target instrument3 Star1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
)
(:goal (and
	(have_image Phenomenon3 image1)
	(have_image Star4 image0)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 2
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 2
3. (turn_to satellite1 star4 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star4)
   goals met: 0 of 2
4. (calibrate satellite0 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 0 of 2
5. (turn_to satellite1 star1 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 star1)
   goals met: 0 of 2
6. (turn_to satellite0 phenomenon3 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon3)
   goals met: 0 of 2
7. (calibrate satellite1 instrument3 star1)
   added: (calibrated instrument3)
   goals met: 0 of 2
8. (take_image satellite0 phenomenon3 instrument1 image1)
   added: (have_image phenomenon3 image1)
   goals met: 1 of 2
9. (turn_to satellite1 star4 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 star4)
   goals met: 1 of 2
10. (take_image satellite1 star4 instrument3 image0)
   added: (have_image star4 image0)
   goals met: 2 of 2
